{
  "_name_or_path": "google/t5-efficient-large",
  "architectures": [
    "T5ForConditionalGeneration"
  ],
  "chronos_config": {
    "context_length": 30,
    "eos_token_id": 1,
    "model_type": "seq2seq",
    "n_special_tokens": 2,
    "n_tokens": 4096,
    "num_samples": 20,
    "pad_token_id": 0,
    "prediction_length": 30,
    "temperature": 1.0,
    "tokenizer_class": "MeanScaleUniformBins",
    "tokenizer_kwargs": {
      "high_limit": 15.0,
      "low_limit": -15.0
    },
    "top_k": 50,
    "top_p": 1.0,
    "use_eos_token": true
  },
  "classifier_dropout": 0.0,
  "d_ff": 4096,
  "d_kv": 64,
  "d_model": 1024,
  "decoder_start_token_id": 0,
  "dense_act_fn": "relu",
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "feed_forward_proj": "relu",
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "is_gated_act": false,
  "layer_norm_epsilon": 1e-06,
  "model_type": "t5",
  "n_positions": 512,
  "num_decoder_layers": 24,
  "num_heads": 16,
  "num_layers": 24,
  "pad_token_id": 0,
  "relative_attention_max_distance": 128,
  "relative_attention_num_buckets": 32,
  "torch_dtype": "float32",
  "transformers_version": "4.45.2",
  "use_cache": true,
  "vocab_size": 4096
}
