{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "Chronos2Model",
    "parent_library": "chronos.chronos2.model"
  },
  "base_model_name_or_path": "/fsx/ansarnd/repos/chronos-forecasting/test/dummy-chronos2-model",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "self_attention.q",
    "self_attention.k",
    "self_attention.o",
    "output_patch_embedding.output_layer",
    "self_attention.v"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}